app/Controllers/TravelController.php

SELECT *
FROM `plans`
WHERE `user_id` = '1'
SELECT *
FROM `plan_users`
WHERE `plan_id` = '1'
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `plans`.*, `plan_users`.`is_owner`
FROM `plan_users`
JOIN `plans` ON `plans`.`id` = `plan_users`.`plan_id`
WHERE `plan_users`.`user_id` = '1'
AND `plans`.`user_id` != '1'
---
    public function getPlans()
    {
        $planModel = new PlanModel();
        $planUserModel = new PlanUserModel();
        $userModel = new UserModel();
        $userId = session()->get('id');

        // Get user's own plans
        $plans = $planModel->where('user_id', $userId)->findAll();

        // Add shared users info to plans
        foreach ($plans as &$plan) {
            $sharedUsers = $planUserModel->where('plan_id', $plan['id'])->findAll();
            $plan['shared_users'] = [];
            foreach ($sharedUsers as $sharedUser) {
                $user = $userModel->find($sharedUser['user_id']);
                if ($user) {
                    $plan['shared_users'][] = $user['email'];
                }
            }
        }

        // Get plans shared with the user
        $sharedPlans = $planUserModel
            ->select('plans.*, plan_users.is_owner')
            ->join('plans', 'plans.id = plan_users.plan_id')
            ->where('plan_users.user_id', $userId)
            ->where('plans.user_id !=', $userId)
            ->findAll();

INSERT INTO `plans` (`destination`, `start_date`, `end_date`, `activities`, `title`, `user_id`, `created_at`, `updated_at`) VALUES ('Singapore', '2025-01-09', '2025-01-10', 'skjKSLKSJ', 'Shared', '1', '2025-01-10 08:37:09', '2025-01-10 08:37:09')
INSERT INTO `plan_users` (`plan_id`, `user_id`, `is_owner`) VALUES (6, '1', 1)
---
            $db->transStart();

            // Insert into plans table
            $planId = $planModel->insert($data);
            $data['id'] = $planId;

            // Insert into plan_users table
            $planUserModel->insert([
                'plan_id' => $planId,
                'user_id' => session()->get('id'),
                'is_owner' => 1
            ]);

SELECT *
FROM `plans`
WHERE `id` = '6'
 LIMIT 1
SELECT *
FROM `plan_users`
WHERE `plan_id` = '6'
AND `user_id` = '2'
 LIMIT 1
SELECT `users`.`email`
FROM `plan_users`
JOIN `users` ON `users`.`id` = `plan_users`.`user_id`
WHERE `plan_id` = '6'
AND `plan_users`.`user_id` != '1'
SELECT *
FROM `confirmations`
WHERE `plan_id` = '6'
ORDER BY `date` ASC, `time` ASC
---
    public function getPlan($planId)
    {
        $planModel = new PlanModel();
        $planUserModel = new PlanUserModel();
        $confirmationModel = new ConfirmationModel();

        // Check if user owns or has access to plan
        $plan = $planModel->where('id', $planId)->first();
        if (!$plan) {
            return redirect()->to('/plans')->with('error', 'Plan not found');
        }

        $hasAccess = $plan['user_id'] == session()->get('id') ||
                    $planUserModel->where(['plan_id' => $planId, 'user_id' => session()->get('id')])->first();

        if (!$hasAccess) {
            return redirect()->to('/plans')->with('error', 'Unauthorized access');
        }

        $plan['is_owner'] = ($plan['user_id'] == session()->get('id'));

        $sharedUsers = $planUserModel
            ->select('users.email')
            ->join('users', 'users.id = plan_users.user_id')
            ->where('plan_id', $planId)
            ->where('plan_users.user_id !=', $plan['user_id']) // Exclude the owner
            ->findAll();

        $plan['shared_users'] = array_column($sharedUsers, 'email');

        $confirmations = $confirmationModel->where('plan_id', $planId)
            ->orderBy('date', 'ASC')
            ->orderBy('time', 'ASC')
            ->findAll();

SELECT *
FROM `plans`
WHERE `id` = '6'
AND `user_id` = '1'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'taralubis12@gmail.com'
 LIMIT 1
---
    public function addUserToPlan($planId)
    {
        try {
            $planModel = new PlanModel();
            $plan = $planModel->where([
                'id' => $planId,
                'user_id' => session()->get('id')
            ])->first();

            if (!$plan) {
                return $this->failUnauthorized('Not authorized to modify this plan');
            }

            $input = $this->request->getJSON();
            $email = $input->email ?? null;
            if (!$email) {
                return $this->fail('Email is required');
            }

            $userModel = new UserModel();
            $user = $userModel->where('email', $email)->first();

SELECT *
FROM `plan_users`
WHERE `plan_id` = '6'
AND `user_id` = '2'
 LIMIT 1
---
            }

            $planUserModel = new PlanUserModel();
            $exists = $planUserModel->where([
                'plan_id' => $planId,
                'user_id' => $user['id']
            ])->first();

INSERT INTO `plan_users` (`plan_id`, `user_id`, `is_owner`) VALUES ('6', '2', 0)
---
                return $this->fail('User already added to this plan');
            }

            $planUserModel->insert([
                'plan_id' => $planId,
                'user_id' => $user['id'],
                'is_owner' => false
            ]);

SELECT *
FROM `plans`
WHERE `id` = '6'
AND `user_id` = '1'
 LIMIT 1
SELECT *
FROM `plan_users`
WHERE `plan_id` = '6'
AND `is_owner` = 0
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function editPlan($planId)
    {
        $planModel = new PlanModel();
        $planUserModel = new PlanUserModel();
        $userModel = new UserModel();

        $plan = $planModel->where([
            'id' => $planId,
            'user_id' => session()->get('id')
        ])->first();

        if (!$plan) {
            return redirect()->to('/plans')->with('error', 'Plan not found');
        }

        // Get only shared users (excluding owner)
        $sharedUsers = $planUserModel
        ->where('plan_id', $planId)
        ->where('is_owner', 0)
        ->findAll();

        $plan['shared_users'] = [];
        foreach ($sharedUsers as $sharedUser) {
            $user = $userModel->find($sharedUser['user_id']);

SELECT *
FROM `plans`
WHERE `id` = '5'
AND `user_id` = '1'
 LIMIT 1
DELETE FROM `plan_users`
WHERE `plan_id` = '5'
DELETE FROM `plans`
WHERE `id` IN ('5')
---
   public function deletePlan($planId)
    {
        try {
            // Initialize models
            $planModel = new PlanModel();
            $planUserModel = new PlanUserModel();

            // Check if the plan exists and if the user is the owner
            $plan = $planModel->where([
                'id' => $planId,
                'user_id' => session()->get('id') // Only allow the owner to delete the plan
            ])->first();

            if (!$plan) {
                return redirect()->to('/plans')->with('error', 'You are not authorized to delete this plan or the plan does not exist.');
            }

            // Delete related plan_users entries to remove all shared users from the plan
            $planUserModel->where('plan_id', $planId)->delete();

            // Delete the plan
            if ($planModel->delete($planId)) {